; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f14-p13-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)

(above f10 f11)
(above f10 f12)
(above f10 f13)

(above f11 f12)
(above f11 f13)

(above f12 f13)



(origin p0 f9)
(destin p0 f1)

(origin p1 f1)
(destin p1 f2)

(origin p2 f5)
(destin p2 f13)

(origin p3 f9)
(destin p3 f4)

(origin p4 f13)
(destin p4 f3)

(origin p5 f11)
(destin p5 f7)

(origin p6 f8)
(destin p6 f5)

(origin p7 f9)
(destin p7 f13)

(origin p8 f3)
(destin p8 f7)

(origin p9 f4)
(destin p9 f1)

(origin p10 f6)
(destin p10 f11)

(origin p11 f2)
(destin p11 f9)

(origin p12 f4)
(destin p12 f2)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
))
)

; plan
1. (up f0 f9)
   deleted: (lift-at f0)
   added: (lift-at f9)
   goals met: 0 of 13
2. (board f9 p7)
   added: (boarded p7)
   goals met: 0 of 13
3. (board f9 p3)
   added: (boarded p3)
   goals met: 0 of 13
4. (board f9 p0)
   added: (boarded p0)
   goals met: 0 of 13
5. (down f9 f6)
   deleted: (lift-at f9)
   added: (lift-at f6)
   goals met: 0 of 13
6. (board f6 p10)
   added: (boarded p10)
   goals met: 0 of 13
7. (down f6 f4)
   deleted: (lift-at f6)
   added: (lift-at f4)
   goals met: 0 of 13
8. (depart f4 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 13
9. (board f4 p9)
   added: (boarded p9)
   goals met: 1 of 13
10. (board f4 p12)
   added: (boarded p12)
   goals met: 1 of 13
11. (up f4 f11)
   deleted: (lift-at f4)
   added: (lift-at f11)
   goals met: 1 of 13
12. (depart f11 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 2 of 13
13. (board f11 p5)
   added: (boarded p5)
   goals met: 2 of 13
14. (down f11 f1)
   deleted: (lift-at f11)
   added: (lift-at f1)
   goals met: 2 of 13
15. (depart f1 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 3 of 13
16. (depart f1 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 4 of 13
17. (board f1 p1)
   added: (boarded p1)
   goals met: 4 of 13
18. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 4 of 13
19. (board f2 p11)
   added: (boarded p11)
   goals met: 4 of 13
20. (depart f2 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 5 of 13
21. (depart f2 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 6 of 13
22. (up f2 f8)
   deleted: (lift-at f2)
   added: (lift-at f8)
   goals met: 6 of 13
23. (board f8 p6)
   added: (boarded p6)
   goals met: 6 of 13
24. (down f8 f5)
   deleted: (lift-at f8)
   added: (lift-at f5)
   goals met: 6 of 13
25. (board f5 p2)
   added: (boarded p2)
   goals met: 6 of 13
26. (depart f5 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 7 of 13
27. (up f5 f13)
   deleted: (lift-at f5)
   added: (lift-at f13)
   goals met: 7 of 13
28. (board f13 p4)
   added: (boarded p4)
   goals met: 7 of 13
29. (depart f13 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 8 of 13
30. (depart f13 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 9 of 13
31. (down f13 f3)
   deleted: (lift-at f13)
   added: (lift-at f3)
   goals met: 9 of 13
32. (board f3 p8)
   added: (boarded p8)
   goals met: 9 of 13
33. (depart f3 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 10 of 13
34. (up f3 f7)
   deleted: (lift-at f3)
   added: (lift-at f7)
   goals met: 10 of 13
35. (depart f7 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 11 of 13
36. (depart f7 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 12 of 13
37. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 12 of 13
38. (depart f9 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 13 of 13
